Revit API Introduction Labs
Lab7_3_ChangeTilePattern Class
 Change the tiling pattern of the divided surface using the built-in TilePattern enumeration.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public class Lab7_3_ChangeTilePattern : IExternalCommand
Visual Basic (Declaration)
Public Class Lab7_3_ChangeTilePattern _
	Implements IExternalCommand
Visual C++
public ref class Lab7_3_ChangeTilePattern : IExternalCommand
Inheritance Hierarchy
System.Object
 Labs.Lab7_3_ChangeTilePattern
See Also
Lab7_3_ChangeTilePattern Members
Labs Namespace